---
kind: method
id: M:Autodesk.Revit.UI.Macros.UIMacroManager.EditModule(Autodesk.Revit.DB.Macros.MacroModule)
source: html/543fecac-0dc2-42bd-6cb1-143e160680e3.htm
---
# Autodesk.Revit.UI.Macros.UIMacroManager.EditModule Method

Edits the macro in sharp develop.

## Syntax (C#)
```csharp
public void EditModule(
	MacroModule module
)
```

## Parameters
- **module** (`Autodesk.Revit.DB.Macros.MacroModule`) - The macro module.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null